---
kind: type
id: T:Autodesk.Revit.DB.EdgeArrayArrayIterator
source: html/1457335d-14ea-97dd-e7ef-8b294b23119b.htm
---
# Autodesk.Revit.DB.EdgeArrayArrayIterator

An iterator to an array or edge arrays.

## Syntax (C#)
```csharp
public abstract class EdgeArrayArrayIterator : APIObject,
	IEnumerator
```